{
    "title": "Playing the digital dialectic game: Writing pedagogy with \ngenerative AI\nRebekah Shultz Colby\nUniversity of Denver, Writing Program, USA\nA R T I C L E  I N F O\nKeywords:\nGenerative AI\nCritical play\nEthics\nEmergence\nAleatory\nEpiphany\nTransfer\nCritical incident\nA B S T R A C T\nThis article explores teaching writing with generative AI as critical play where students and \nteachers engage in an ethically dialectical and aleatory game with generative AI. I qualitatively \nsurveyed 24 writing teachers about how they teach writing with generative AI as well as its \nadvantages and disadvantages. I discovered that teachers used generative AI to teach about the \nethics of generative AI’s design and rhetorical use to avoid plagiarism. Teachers also critically \nplayed with generative AI to teach the writing process of invention, drafting, revision, and \nediting. Specifically, the critical, dialectical interplay of human and machine invents in aleatory \nand emergent ways, creating moments of epiphany for students and teachers within the writing \nprocess for invention, drafting, revision, and editing while the real time pace of generative AI \ndemocratizes education, making writing and teaching more accessible for them.\n1. Introduction: Who’s afraid of generative AI?\nLoudly touted as a disruptor, the public introduction of ChatGPT-3 on November 30, 2022 and ChatGPT-4 on March 14, 2023 \nstruck both fear and cautious optimism into the hearts of writing teachers and students alike as the chatbot was able to quickly generate \ncohesive thousand-word essays in almost any genre. While students and teachers are intrigued about the creative potential of \ngenerative AI, for the first time, professional knowledge-work and writing jobs are at risk of being replaced, or at least fundamentally \ntransformed, by automation, leaving both students and teachers unsure about the future. Reflecting students’ fears, a 2023 Pew study \nfound that 42% of 18–29-year-olds were concerned about AI’s impact on the future (Tyson & Kikuchi, 2023), which makes sense when \nthe chief executive of IBM predicts that 30% of white-collar jobs will be automated in the future (Goldberg, 2023) and Forbes reports \nthat ChatGPT is devastating the freelance writing job market (Shrivastava, 2023). For teachers, the outlook is not much better. A study \nby Ed Felten et al., 2023found that the teaching of postsecondary English language and literature are professions most highly impacted \nby generative AI, which CNBC interpreted to mean that these teachers should worry about losing their jobs to generative AI (Chun, \n2023). In these early days, such concern is warranted as Sal Khan gave a TED Talk about developing chatbots that can individualize \ntutoring for students (Singer, 2024) and at least one study has shown feedback on student writing is equivalent to human feedback \n(Ruwe & Mayweg-Paus, 2023). Meanwhile, Sam Altman, the chief executive of ChatGPT-4′s OpenAI, met with Congress to discuss how \nemployers could retrain employees to work more effectively with generative AI instead of firing them, which Altman argued was a \nproblem for the government and not for generative AI developers to solve (Goldberg, 2023).\nOf course, the other fear both writing teachers and students share about ChatGPT is academic integrity and plagiarism, even as \nsome embrace generative AI’s potential as a learning tool (Lingard, 2023). For instance, the New York City school system banned the \nE-mail address: Rebekah.shultzcolby@du.edu. \nContents lists available at ScienceDirect\nComputers and Composition\njournal homepage: www.elsevier.com/locate/compcom\nhttps://doi.org/10.1016/j.compcom.2025.102915\nComputers and Composition 75 (2025) 102915 \nAvailable online 24 January 2025 \n8755-4615/© 2025 The Author(s). \nPublished by Elsevier Inc. \nThis is an open access article under the CC BY-NC-ND license \n( http://creativecommons.org/licenses/by-nc-nd/4.0/ ).",
    "abstract": "",
    "sections": {}
}